//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   プレイヤーのソース
//!
//! @date   2017/02/07~
//!
//! @author sugiura	
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

#include "Player.h"

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Player::Player()
{
	//\Resources\Images\Character\Player
	//各変数の設定
	m_handle = new Texture(L"Resources\\Images\\Character\\Player\\move.png");
	m_grp_x = 0;
	m_grp_y = 0;
	m_grp_w = 90;
	m_grp_h = 130;
	m_pos_x = 0;
	m_pos_y = 0;
	m_spd_x = 0;
	m_spd_y = 0;
	m_state = 1;
	m_rect = { m_grp_x, m_grp_y, m_grp_w, m_grp_h };
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Player::~Player()
{

}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Player::Update()
{
	//キーボードで移動
	keyMove();
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Player::Render()
{
	DrawObject(m_handle, m_pos_x, m_pos_x, m_rect);

	//ハンドル 座標XY 切り出す範囲, 色, ラジアン値, 回転の中心座標, 拡大倍率
	//g_spriteBatch->Draw(m_handle->m_pTexture, Vector2(0, 0), &rect, Colors::White, 0.0f, Vector2(0, 0), Vector2(1, 1));

}

//--------------------Update(),Render()以外の関数を定義---------------//

//----------------------------------------------------------------------
//! @brief キーボード操作で移動
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Player::keyMove()
{
	// 移動中の入力
	if (m_spd_x == 0 && m_spd_y == 0)
	{	//速度の設定
		if (g_key.Right)
		{
			m_spd_x = 5;
		}
		else if (g_key.Left)
		{
			m_spd_x = -5;
		}
		else if (g_key.Up)
		{
			m_spd_y = -5;
		}
		else if (g_key.Down)
		{
			m_spd_y = 5;
		}
	}
}

