//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameTitle.h
//!
//! @brief  基本クラスのヘッダーファイル
//!
//! @date   日付		2016/12/13
//!
//! @author 制作者名	sugiura
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once

class GameBase
{
private:

public:
	virtual ~GameBase() {};

	virtual void Update() = 0;	//更新処理用の仮想関数
	virtual void Render() = 0;	//描画処理用の仮想関数
};

